[
	{
		"name" : "Jeremy Keith",
		"time" : "",
		"title" : "",
		"avatar" : "/images/speakers/jeremy_keith.jpg",
		"intro" : "Jeremy is a respected voice within our industry, having spoken at notable conferences such as An Event Apart, Mobilism, Web Directions, SXSW, DIBI and Build. He has also written three books on Javascript and HTML5.",
		"url"   : "http://adactio.com",
		"twitter" : "adactio",
		"session_title": "",
		"session_desc": "",
		"speaker" : true,
		"category": "Web Platform"
	},
	{
		"name" : "Vitaly Friedman",
		"time" : "",
		"title" : "Vitaly Friedman loves beautiful content and doesn’t like to give in easily. Vitaly is writer, speaker, author and editor-in-chief of Smashing Magazine. He runs responsive Web design workshops and loves solving complex performance problems.",
		"avatar" : "/images/speakers/vitaly_friedman.jpg",
		"intro" : "",
		"url"   : "http://www.smashingmagazine.com/",
		"twitter" : "smashingmag",
		"session_title": "",
		"session_desc": "",
		"speaker" : true,
		"category": "Performance"
	},
	{
		"name" : "Patrick Hamann",
		"avatar" : "/images/speakers/patrick_hamann.jpg",
		"intro" : "Patrick is a front-end engineer at the Financial Times in London where – amongst other things – he is helping to build the next generation of their web platform. Prior to the FT he spent the last 3 years developing theguardian.com.",
		"speaker" : true,
		"category": "Performance"
	},
	{
		"name" : "Alex Feyerke",
		"avatar" : "/images/speakers/alex_feyerke.jpg",
		"intro" : "Huge advocate for Offline First. Part of the Hood.ie team, and loves spending time with friends in parks, riding his bike and always enjoys a good bouldering session.",
		"speaker" : true,
		"category": "Offline-first"
	},
	{
		"name" : "David Rousset",
		"avatar" : "/images/speakers/david_rousset.jpg",
		"intro" : "David Rousset is a Senior Program Manager at Microsoft, in charge of driving adoption of HTML5 standards. He’s the co-author of the WebGL Babylon.js open-source engine.",
		"speaker" : true,
		"category": "Browsers"
	},
	{
		"name" : "Lea Verou",
		"avatar" : "/images/speakers/lea_verou.jpg",
		"intro": "Lea is a speaker, author of \"CSS Secrets\", and an Invited Expert in the CSS Working Group. She worked as a Developer Advocate for the W3C and is currently a Research Assistant at MIT.",
		"speaker" : true,
		"category": "CSS"
	},
	{
		"name" : "Paul Kinlan",
		"avatar" : "/images/speakers/paul_kinlan.jpg",
		"intro": "Paul is a Developer Advocate on the Google Chrome team. He's working on getting the web to work well on mobile. He once did this thing called Web Intents that someday will change the web for good.",
		"speaker" : true,
		"category": "Mobile"
	},
	{
		"name" : "Feross Aboukhadijeh",
		"avatar" : "/images/speakers/feross.jpg",
		"intro" : "Ferros is a well-known name in the WebRTC world. Been building PeerCDN, a peer-to-peer CDN and is currently busy with WebTorrent, a streaming BitTorrent client for the browser, powered by WebRTC.",
		"speaker" : true,
		"category": "Realtime"
	}
]
