[
	{
		"title": "Tuesday Sep 5th: Day 1",
		"program": [
			{
				"time": "08:00 - 09:00",
				"name": "Breakfast & registration",
				"icon": "registration.png",
				"info": "We'll be serving coffees and croissants for the early birds. Join us in the morning, grab your badge and avoid the queue!"
			},
			{
				"time": "09:00 - 09:15",
				"name": "Magical opening",
				"icon": "opening.svg"
			},
			{
				"time": "09:15 - 10:00",
				"name": "The Magic of Color",
				"abstract": "'The Magic of Color' and how you can use variables, filters, blend-modes and 'CSS4' color functions to create wonderful layouts and organize your code better; and how you can use all this today with PostCSS.",
				"who": "evangelina-ferreira"
			},
			{
				"time": "10:00 - 10:45",
				"name": "Why is Samsung building their own browser?",
				"abstract": "",
				"who": "peter-shaughnessy"
			},
			{
				"time": "10:45 - 11:00",
				"name": "Break",
				"icon": "break.png"
			},
			{
				"time": "11:00 - 11:45",
				"name": "Real world connectivity: Beyond the bubble (performance, emerging markets)",
				"abstract": "Every talk you’ll hear about ‘web performance’ will tell you that shaving 100ms from response time produced a 1% sales yield for Amazon, or maybe that 40% of web visitors will abandon your site when it takes more then 3 seconds to load? While those are impressive, there are some more interesting metrics that we need to talk about.\n\n Did you know that 43% of the humans on this planet have access to the internet, but 57% do not? Did you know that in 2016 India brought 100 million NEW users to the internet for the very first time? When you take a glance into the current state of global connectivity, you might realise that the internet you think you know so well exists on an entirely different plane.\n\n Through the guise of user-experience and empathy, we’ll study the state of global connectivity, connection speeds, population, and the costs of data in order to re-centre how we think about our role as designers and developers for the web today.",
				"who": "ben-schwarz"
			},
			{
				"time": "11:45 - 12:30",
				"name": "Will React and React Native become the next browser?",
				"abstract": "",
				"who": "ken-wheeler"
			},			
			{
				"name": "Lunch time!",
				"time": "12:30 - 14:00",
				"icon": "lunch.png"
			},
			{
				"time": "14:00 - 14:45",
				"name": "Magic Tricks with CSS Houdini",
				"abstract": "This talk will focus on the working being done by the CSS Houdini Task Force to provide us with the ability to extend the browser's render engine with JavaScript, above and beyond simply running JS on the main thread or a web worker. \n\nThis talk will focus on the following:\n\nWhat is the Houdini Task Force?\n\nWhat types of things can we expect to see coming from them?\n\nWhat's available today and where, what's going to be available in the future\n\nPractical examples, with code, that can be played with today\n\n\nAs what is available is currently being worked on, this talk with be as up-to- date of an overview of what's available and coming in the future as can be provided. This stuff is definitely in the future type stuff, but learning about it now will prepare attendees for what they can expect browsers to be capable of doing in the upcoming years.",
				"who": "sam-richard"
			},
			{
				"time": "14:45 - 15:30",
				"name": "Scale Down, People Up: Making the Web More Approachable",
				"abstract": "",
				"who": "jessica-lord"
			},
			{
				"name": "Break",
				"time": "15:30 - 15:45",
				"icon": "break.png"
			},
			{
				"time": "15:45 - 16:30",
				"name": "LiveJS: Making Music with JavaScript",
				"abstract": "We are proud to have Martin Schuhfuss, Matt McKegg and Ruth John joining us to show what's possible with WebMIDI, and JavaScript to generate music, visualizations and lightning. Our venue VEGA is the centerstage for many bands in Copenhagen, and with LiveJS we are showing that JavaScript can play music too!  ",
				"who": ["ruth-john","martin-schuhfuss","matt-mckegg"]
			},
			{
				"name": "Panel debate: Day 1",
				"time": "16:30 - 17:15",
				"abstract": "A summary of Day 1 talks, facilicated by our lovely host. Open QA.",
				"who" : "*"
			},
			{
				"name": "ColdFront social",
				"time": "17:30 - 20:00",
				"icon": "party.png"
			},
			{
				"name": "Techfestival keynote: Olafur Eliasson",
				"time": "20:00 - 20:30",
				"who" : "*"
			},
			{
				"name": "Techfestival afterparty!",
				"time": "20:30 - 24:00",
				"icon": "party.png"
			}
		]
	},
	{
		"title": "Wednesday Sep 6th: Day 2",
		"program": [
			{
				"time": "09:00 - 09:15",
				"name": "Opening",
				"icon": "welcome.png"
			},
			{
				"time": "09:15 - 10:00",
				"name": "Bridging the web and the physical world",
				"abstract": "The improvements in size, features and price of hardware has ushered new opportunities in creating small, smart devices (aka internet-of-things) which can be integrated in homes and industries. In these places, the devices can help automate common tasks, as well as give information about the state of things, such as temperature of a machine, air quality etc.\n\nInstalling an app for one such devices might seem fine at first, but it doesn’t scale nicely to 100s of devices, or devices you seldom interact with, like in an industrial setting. Devices might even have different security restrictions, like being locked behind a physical key.\n\nSo how do we communicate with these devices? The web has always been known for its low fraction and easy onboarding. No need to install any software, just type in a URL and off you go. And it has always been very secure with its sandbox system, and companies can even have URLs be restricted to certain WiFi networks (intranet).\n\nIn the last couple of years, the web has taken a quantum leap in usability, with offline support, and many ways to make the experience very app-like. So the question is unavoidable, can the web be the platform to make smart devices succeed?\n\nThe web lives in a sandbox, and its security model has allowed people to trust it and for it to grow enormously over time, but the world is changing around us. There is a growing need to access new hardware capabilities such as sensors or just connect to devices around us.\n\nThe great news is that the web sandbox is growing with new capabilities and with new security models, allowing us to connect to devices via Bluetooth, USB or even talk NFC. There are now even ways to directly get magnetometer readings on Android devices.\n\nIn this talk we will look at this new landscape and how it enables the new wave of smart devices. We will also look at how easy it is to use some of these new APIs.\n\nCome join me for a look at how the web can make your smart devices success",
				"who": "kenneth-rohde"
			},
			{
				"time": "10:00 - 10:45",
				"name": "From Doodles to Dashboards, Data Flows, and Docs",
				"abstract": "Developers don’t always take a step back to think about how they be better at learning and teaching: at engaging and audience and building a bigger product community. That’s where technical diagramming can really make an impact. Using visuals can help you unblock your work, uncover bugs, and even have a better understanding of a technical concept you thought you had already mastered. This talk will go over some of those benefits and how to use doodling and technical diagramming in your own work to be a more effective developer and community member.",
				"who": "una-kravets"
			},
			{
				"time": "10:45 - 11:00",
				"name": "Break",
				"icon": "break.png"
			},
			{
				"time": "11:00 - 11:45",
				"name": "TBA",
				"icon": "unknown.svg"
			},
			{
				"time": "11:45 - 12:30",
				"name": "TBA",
				"icon": "unknown.svg"
			},			
			{
				"name": "Lunch time!",
				"time": "12:30 - 14:00",
				"icon": "lunch.png"
			},
			{
				"time": "14:00 - 15:00",
				"name": "TBA",
				"icon": "unknown.svg"
			},					
			{
				"time": "15:00 - 15:45",
				"name": "Closing keynote",
				"icon": "ghost.svg"
			},		
			{
				"name": "Panel debate: Day 2",
				"time": "15:45 - 16:30",
				"abstract": "A summary of Day 2 talks, facilicated by our lovely host. Open QA.",
				"who" : "*"
			},
			{
				"name": "Closing + Family photo!",
				"time": "16:30 - 16:45",
				"icon": "party.png"
			},			
			{
				"name": "Break",
				"time": "16:45 - 17:00",
				"icon": "closing.png"
			},
			{
				"name": "LiveJS Artistic Performance",
				"abstract": "LiveJS, a collective of audio and visual artists, will perform a live experiences with sound, visualizations and lights. All powered by JavaScript! \n\nWhy JS? Because that's the main technology we use: JavaScript.",
				"who": ["ruth-john","martin-schuhfuss","matt-mckegg"],
				"time": "17:00 - 18:00"
			},			
			{
				"name": "ColdFront social",
				"time": "18:00 - 20:00",
				"icon": "closing.png"
			},			
			{
				"name": "Techfestival keynote: Charles Adler",
				"time": "20:00 - 21:00",
				"who": "charles-adler"
			},		
			{
				"name": "Techfestival party!",
				"time": "21:30 - 24:00",
				"icon": "party.png"
			}
		]
	}	
]
