[
	{
		"name": "Ben Schwarz",
		"slug" : "ben-schwarz",
		"intro": "Founder of Calibre & organizer of JSCONF AU",
		"bio": "",
		"twitter" : "",
		"github" : "benschwarz"
	},	
	{
		"name": "Evangelina Ferreira",
		"slug" : "evangelina-ferreira",
		"intro": "Front-end developer & organizer of CSSConf Argentina",
		"bio": "Eva Ferreira is a Front-End Developer, professor at the National Technological University of Argentina and UI Developer in Aerolab. In her free time she also helps organize CSSConf Argentina.",
		"twitter" : "evaferreira92",
		"github" : ""
	},
	{
		"name": "Kenneth Rohde Christiansen",
		"slug" : "kenneth-rohde",
		"intro": "Software engineer and architect at Intel",
		"bio": "Kenneth Rohde Christiansen is a Danish software engineer and architect, specialized in mobile and web technology. Working at Intel out of Copenhagen, Kenneth helps define Intel’s strategy and plans regarding the Web Platform, as well as puts it into action. Before joining Intel, Kenneth was employed by Nokia (Denmark and Brazil) where he worked on the Nokia N9 web browser, Qt, WebKit, as well as many other mobile projects. Currently working on Progressive Web Apps and emerging web standards like Web App Manifest, Generic Sensors, Web NFC, Web XR etc.",
		"twitter": "kennethrohde",
		"github": "kenchris"
	},
	{
		"name": "Peter O'Shaughnessy",
		"slug" : "peter-shaughnessy",
		"intro": "Web developer advocate at Samsung",
		"bio": "I'm a web developer advocate at Samsung - part of the team focused on our web browser, the imaginatively titled 'Samsung Internet'! I help to share the latest possibilities for web apps by coding demos, writing articles and speaking. Previously I was a full stack developer back before “full stack” was a thing, gradually focusing more on the front-end as browsers grew more advanced. In Pearson's Future Technologies team, I helped the world's biggest education company to innovate with new web and native technologies. At pebble {code} I led the development of a hybrid Bluetooth app for a global logistics company. But my biggest tech love is the web - I got very excited about HTML5 around 2010 and I've been mostly geeking out about web APIs ever since!",
		"twitter": "poshaughnessy",
		"github": "poshaughnessy"
	},
	{
		"name": "Ken Wheeler",
		"slug" : "ken-wheeler",
		"intro": "Director of Open Source at Formidable",
		"bio": "Ken Wheeler is the Director of Open Source at Formidable and the author of open source libraries such as Slick Carousel, Spectacle, webpack-dashboard and react-music.",
		"twitter": "ken_wheeler",
		"github": "kenwheeler"
	},
	{
		"name": "Una Kravets",
		"slug" : "una-kravets",
		"intro": "UI Engineer on the Front-end Infrastructure team at DigitalOcean",
		"bio": "Una Kravets is an international speaker, (technical writer](https://una.im], [open source](https://github.com/una) advocate, and UI Engineer on the Front-end Infrastructure team at [DigitalOcean](http://digitalocean.com). She’s written for various online publications such as A List Apart, Smashing Magazine, and Sitepoint. Una also co-hosts the [Toolsday](http://toolsday.io) podcast and started both the DC and Austin Sass Meetups. She's a performance nerd, loves the open source community and listens to way too many audio books.",
		"twitter": "una",
		"github": "una"
	},
	{
		"name": "Jessica Lord",
		"slug" : "jessica-lord",
		"intro": "Urban-designer-turned-developer @ MongoDB",
		"bio": "Jessica Lord is an urban-designer-turned-developer currently working on tools in Node.js at MongoDB. Previously, she was at GitHub where she started the Electron team and grew her passion for open source and making tools to enable others to build on the web.",
		"twitter": "jllord",
		"github": "jllord"
	},
	{
		"name": "Sam Richard",
		"slug" : "sam-richard",
		"intro": "Lead engineering and strategy for IBM’s team experience",
		"bio": "Sam Richard, better known as Snugug throughout the Internet, is a developer with design tendencies and a love of building open source tools to help with both. Sam geeks out on content strategy, team process, and cultural transformation. When not at work, he is the author of North, a co-founder of SassConf, and an accomplished bacon connoisseur.",
		"twitter": "jllord",
		"github": "jllord"
	},
    {
        "name": "Ruth John",
        "slug" : "ruth-john",
        "intro": "Ruth is a digital artist and projectoralist.",
        "bio": "She mixes video and other abstract coded clips with her own hand coded software: Vixxrr. A collective of audio and visual artists who build live experiences, shows and installations. Why JS? Because that's the main technology we use: JavaScript. Read more about them on [livejs.net](http://livejs.network/)",
        "twitter": "Rumyra",
        "github": "Rumyra"
    },
    {
        "name": "Martin Schuhfuss",
        "slug" : "martin-schuhfuss",
        "intro": "Martin loves working with JavaScript and self-made electronics",
        "bio": "Martin loves working with JavaScript and self-made electronics, like lighting contraptions and DMX-interfaces. Creator of the fivetwelve-library to control professional lighting using CSS.",
        "twitter": "usefulthink",
        "github": "usefulthink"
	},
    {
        "name": "Matt Mckegg",
        "slug" : "matt-mckegg",
        "intro": "Matt is a JavaScript hacker and backyard musician.",
        "bio": "Matt is a JavaScript hacker and backyard musician. He built the awesome Loop Drop, an open source tool for live electronic music with Electron and Web Audio.",
        "twitter": "MattMcKegg",
        "github": "mmckegg"
    },
    {
        "name": "Lars Gunder Knudsen",
        "slug" : "lars-gunder-knudsen",
        "intro": "Software engineer who created the last S30 Nokia Snake and worked on Nokia N9 web browser.",
        "bio": "Lars Gunder Knudsen is a software engineer and tech evangelist, usually moving around somewhere outside the box with others, combining people, music, graphics, games, IoT, mobile and web in new ways. He has been coding since childhood and among other things, created the last S30 Nokia Snake and worked on Nokia N9 web browser.  Currently, he is raising awareness of practical ways to web enable legacy hardware with traditional industries and for science education in developed and developing regions."
	},
	{
		"name": "Jordan Santell",
		"slug": "jordan-santell",
		"intro": "Shaping the future of WebXR at Google",
		"bio": "Jordan Santell is a software engineer, open web advocate, cat dad, and metalhead musician living in San Francisco. Currently, he's shaping the future of WebXR at Google, and previously worked on experimental browsers at Mozilla and lead the Firefox Performance DevTools team. He enjoys audio engineering, hacking on open source tooling, Web Audio, and daydreaming about how weird the future will be."
	},
	{
		"name": "Eric Muntz",
		"slug": "eric-muntz",
		"intro": "VP of Product, Mailchimp",
		"bio": "VP of Product, Mailchimp"
	},	
    {
        "name": "Charles Adler",
        "slug" : "charles-adler",
        "intro": "Kickstarter Co-Founder & Founder of Lost Arts",
        "bio": "founder @lostartscenter, co-founder @kickstarter, @chidm exec board; Nomadic designer, cyclist, runner, environmentalist...",
        "twitter": "cadler",
		"github": "cadler",
		"keynote": true
	},
	{
		"name": "Henrik Joreteg",
		"slug": "henrik-joreteg",
		"intro": "Henrik Joreteg is a JavaScript developer, author, speaker, and educator.",
		"bio": "Henrik Joreteg is a JavaScript developer, consultant, author, speaker, and educator.\n\nHe does independent contracting heavily focused on building Progressive Web Apps with tools like Redux and React/Preact. Currently he's working with Starbucks; before that Groove, Microsoft, and others.\n\nHenrik is a huge proponent of the web as a mobile app platform and wants to help developers push it to the next level. To that end, you may have seen his blog posts on topics such as abandoning iOS for the sake of the web or installng web apps or seen some of his talks, such as this one on pocket-sized JavaScript. He has also taught workshops for Frontend Masters and O'Reilly, co-developed the Ampersand.js framework, authored Human JavaScript, created Talky.io, and has open sourced libraries such as SimpleWebRTC, hjs-webpack, and many others.\n\nYou can follow him on Twitter at @HenrikJoreteg or keep an eye out for his posts at joreteg.com.",
		"twitter": "HenrikJoreteg",
		"keynote": true
	},	
	{
		"name": "Olafur Eliasson",
		"slug": "olafur-eliasson",
		"intro": "Danish-Icelandic artist Olafur Eliasson",
		"bio": "Olafur Eliasson’s art is driven by his interests in perception, movement, embodied experience, and feelings of self. Eliasson strives to make the concerns of art relevant to society at large. Art, for him, is a crucial means for turning thinking into doing in the world. Eliasson’s diverse works – in sculpture, painting, photography, film, and installations – have been exhibited widely throughout the world. Not limited to the confines of the museum and gallery, his practice engages the broader public sphere through architectural projects and interventions in civic space.",
		"twitter": "eliassonolafur",
		"keynote": true
	}
]
